[NoCoverage] ArrowFunction
src/index.ts:1:18
-export const sum=(a:number,b:number):number => a+b;
+export const sum=() => undefined;
 
 

[NoCoverage] ArithmeticOperator
src/index.ts:1:48
-export const sum=(a:number,b:number):number => a+b;
+export const sum=(a:number,b:number):number => a - b;
 
 
