[Killed] ConditionalExpression
src/check/isObjectLike.ts:9:9
 
 export const isObjectLike = (value: unknown): value is genericObject => {
     return (
-        !(value instanceof Date)
-         && !(value instanceof RegExp) 
-         && !Array.isArray(value)
-         && typeOf(value) === "object"
+        false
     )
 };
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality
