[Killed] BlockStatement
src/arrays/sumBy.ts:3:80
 
 import {arraylable} from "./arraylable"
-export function sumBy<T>(dataSource: T[],accesor: (item: T) => number): number {
-
-    return arraylable<T>(dataSource).reduce((sum:number,item:T)=>sum+accesor(item),0)
-}
+export function sumBy<T>(dataSource: T[],accesor: (item: T) => number): number {}
killedBy: sumBy() should sum every single number by the given accesor
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ArithmeticOperator
src/arrays/sumBy.ts:5:66
 import {arraylable} from "./arraylable"
 export function sumBy<T>(dataSource: T[],accesor: (item: T) => number): number {
 
-    return arraylable<T>(dataSource).reduce((sum:number,item:T)=>sum+accesor(item),0)
+    return arraylable<T>(dataSource).reduce((sum:number,item:T)=>sum - accesor(item),0)
 }
killedBy: sumBy() should sum every single number by the given accesor
statusReason: expected -10 to be 10 // Object.is equality

[Killed] ArrowFunction
src/arrays/sumBy.ts:5:45
 import {arraylable} from "./arraylable"
 export function sumBy<T>(dataSource: T[],accesor: (item: T) => number): number {
 
-    return arraylable<T>(dataSource).reduce((sum:number,item:T)=>sum+accesor(item),0)
+    return arraylable<T>(dataSource).reduce(() => undefined,0)
 }
killedBy: sumBy() should sum every single number by the given accesor
statusReason: expected undefined to be 10 // Object.is equality
