[Killed] BlockStatement
src/arrays/arraylable.ts:7:55
 //     return Array.isArray(value) ? value : [];
 // }
 
-export const arraylable = <T>(value: unknown): T[] => {
-  return Array.isArray(value) ? (value as T[]) : [];
-};
+export const arraylable = <T>(value: unknown): T[] => {};
 
 
killedBy: Sum() should return 6 when receive [1,2,3]
statusReason: Cannot read properties of undefined (reading 'reduce')
