[Killed] BlockStatement
src/arrays/sum.ts:3:46
 import {arraylable} from "./arraylable"
 
-export const Sum = (value:number[]):number =>{
-    return (arraylable(value) as number[]).reduce((acc,cur)=>acc+cur,0)
-}
+export const Sum = (value:number[]):number =>{}
killedBy: Sum() should return 6 when receive [1,2,3]
statusReason: expected undefined to strictly equal 6

[Killed] ArithmeticOperator
src/arrays/sum.ts:4:62
 import {arraylable} from "./arraylable"
 
 export const Sum = (value:number[]):number =>{
-    return (arraylable(value) as number[]).reduce((acc,cur)=>acc+cur,0)
+    return (arraylable(value) as number[]).reduce((acc,cur)=>acc - cur,0)
 }
killedBy: Sum() should return 6 when receive [1,2,3]
statusReason: expected -6 to strictly equal 6

[Killed] ArrowFunction
src/arrays/sum.ts:4:51
 import {arraylable} from "./arraylable"
 
 export const Sum = (value:number[]):number =>{
-    return (arraylable(value) as number[]).reduce((acc,cur)=>acc+cur,0)
+    return (arraylable(value) as number[]).reduce(() => undefined,0)
 }
killedBy: Sum() should return 6 when receive [1,2,3]
statusReason: expected undefined to strictly equal 6
