[Killed] BlockStatement
src/check/isEmpty.ts:2:50
 
-export const isEmpty = (valor:unknown):boolean =>{
-
-    const safeObject = valor
-    const isCountable = safeObject instanceof Object || safeObject instanceof Array;
-
-    if(!isCountable) return true;
-
-    return Object.entries(safeObject).length === 0;
-
-}
+export const isEmpty = (valor:unknown):boolean =>{}
 
killedBy: isEmpty without test.each() for string raul sholud be true
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:5:25
 export const isEmpty = (valor:unknown):boolean =>{
 
     const safeObject = valor
-    const isCountable = safeObject instanceof Object || safeObject instanceof Array;
+    const isCountable = true;
 
     if(!isCountable) return true;
killedBy: isEmpty without test.each() for string raul sholud be true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:5:25
 export const isEmpty = (valor:unknown):boolean =>{
 
     const safeObject = valor
-    const isCountable = safeObject instanceof Object || safeObject instanceof Array;
+    const isCountable = false;
 
     if(!isCountable) return true;
killedBy: isEmpty with test.each() isEmpty('[1,2]') should be false
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:7:8
     const safeObject = valor
     const isCountable = safeObject instanceof Object || safeObject instanceof Array;
 
-    if(!isCountable) return true;
+    if(false) return true;
 
     return Object.entries(safeObject).length === 0;
killedBy: isEmpty without test.each() for string raul sholud be true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/check/isEmpty.ts:7:29
     const safeObject = valor
     const isCountable = safeObject instanceof Object || safeObject instanceof Array;
 
-    if(!isCountable) return true;
+    if(!isCountable) return false;
 
     return Object.entries(safeObject).length === 0;
killedBy: isEmpty without test.each() for string raul sholud be true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:9:12
 
     if(!isCountable) return true;
 
-    return Object.entries(safeObject).length === 0;
+    return false;
 
 }
killedBy: isEmpty without test.each() for an empty array should be true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isEmpty.ts:9:12
 
     if(!isCountable) return true;
 
-    return Object.entries(safeObject).length === 0;
+    return true;
 
 }
killedBy: isEmpty with test.each() isEmpty('[1,2]') should be false
statusReason: expected true to be false // Object.is equality
