[Killed] BlockStatement
src/check/isFunction.ts:5:66
 
 
 
-export const isFunction = (value:unknown):value is AnyFunction =>{
-    return typeof value === "function";
-}
+export const isFunction = (value:unknown):value is AnyFunction =>{}
killedBy: isFunction() should return true when the value is a function
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isFunction.ts:6:12
 
 
 export const isFunction = (value:unknown):value is AnyFunction =>{
-    return typeof value === "function";
+    return true;
 }
killedBy: isFunction() should return false when the value is not a function
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/check/isFunction.ts:6:12
 
 
 export const isFunction = (value:unknown):value is AnyFunction =>{
-    return typeof value === "function";
+    return typeof value !== "function";
 }
killedBy: isFunction() should return true when the value is a function
statusReason: expected false to be true // Object.is equality
