[Killed] BlockStatement
src/check/isNullorUndefined.ts:4:79
 
 type isNullorUndefined  = null | undefined;
 
-export const isNullorUndefined = (value:unknown):value is isNullorUndefined =>{
-    return value === null || value === undefined;
-}
+export const isNullorUndefined = (value:unknown):value is isNullorUndefined =>{}
killedBy: isNullorUndefined() should return true when value is null
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isNullorUndefined.ts:5:12
 type isNullorUndefined  = null | undefined;
 
 export const isNullorUndefined = (value:unknown):value is isNullorUndefined =>{
-    return value === null || value === undefined;
+    return false;
 }
killedBy: isNullorUndefined() should return true when value is null
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isNullorUndefined.ts:5:12
 type isNullorUndefined  = null | undefined;
 
 export const isNullorUndefined = (value:unknown):value is isNullorUndefined =>{
-    return value === null || value === undefined;
+    return false || value === undefined;
 }
killedBy: isNullorUndefined() should return true when value is null
statusReason: expected false to be true // Object.is equality
