[Killed] BlockStatement
src/check/isObejct.ts:3:51
 import {typeOf} from '../misc/typeOf';
 
-export const isObject = (value:unknown):boolean =>{
-    return typeOf(value) === "object";
-}
+export const isObject = (value:unknown):boolean =>{}
killedBy: isObject() should return true when the value is an object
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isObejct.ts:4:12
 import {typeOf} from '../misc/typeOf';
 
 export const isObject = (value:unknown):boolean =>{
-    return typeOf(value) === "object";
+    return true;
 }
killedBy: isObject() should return false when the value is not an object
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/check/isObejct.ts:4:12
 import {typeOf} from '../misc/typeOf';
 
 export const isObject = (value:unknown):boolean =>{
-    return typeOf(value) === "object";
+    return false;
 }
killedBy: isObject() should return true when the value is an object
statusReason: expected false to be true // Object.is equality
