[Killed] BlockStatement
src/check/isObjectLike.ts:7:73
 
 type genericObject = Record<string,unknown>
 
-export const isObjectLike = (value: unknown): value is genericObject => {
-    return (
-        !(value instanceof Date)
-         && !(value instanceof RegExp) 
-         && !Array.isArray(value)
-         && typeOf(value) === "object"
-    )
-};
+export const isObjectLike = (value: unknown): value is genericObject => {};
 
 
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/check/isObjectLike.ts:9:9
 
 export const isObjectLike = (value: unknown): value is genericObject => {
     return (
-        !(value instanceof Date)
+        value instanceof Date
          && !(value instanceof RegExp) 
          && !Array.isArray(value)
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/check/isObjectLike.ts:9:9
 
 export const isObjectLike = (value: unknown): value is genericObject => {
     return (
-        !(value instanceof Date)
-         && !(value instanceof RegExp) 
-         && !Array.isArray(value)
+        !(value instanceof Date) && !(value instanceof RegExp) || !Array.isArray(value)
          && typeOf(value) === "object"
     )
killedBy: isObjectLike() isObjectLike([]) should be false
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/check/isObjectLike.ts:10:13
 export const isObjectLike = (value: unknown): value is genericObject => {
     return (
         !(value instanceof Date)
-         && !(value instanceof RegExp) 
+         && value instanceof RegExp 
          && !Array.isArray(value)
          && typeOf(value) === "object"
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/check/isObjectLike.ts:11:13
     return (
         !(value instanceof Date)
          && !(value instanceof RegExp) 
-         && !Array.isArray(value)
+         && Array.isArray(value)
          && typeOf(value) === "object"
     )
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/check/isObjectLike.ts:12:13
         !(value instanceof Date)
          && !(value instanceof RegExp) 
          && !Array.isArray(value)
-         && typeOf(value) === "object"
+         && typeOf(value) !== "object"
     )
 };
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isObjectLike.ts:12:13
         !(value instanceof Date)
          && !(value instanceof RegExp) 
          && !Array.isArray(value)
-         && typeOf(value) === "object"
+         && true
     )
 };
killedBy: isObjectLike() isObjectLike(null) should be false
statusReason: expected true to be false // Object.is equality
