[Killed] BlockStatement
src/check/isString.ts:3:60
 
 
-export const isString = (valor:unknown ):valor is string =>{
-    return typeof valor === "string";
-}
+export const isString = (valor:unknown ):valor is string =>{}
 
killedBy: isString isString('') should be true
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/check/isString.ts:4:12
 
 
 export const isString = (valor:unknown ):valor is string =>{
-    return typeof valor === "string";
+    return true;
 }
 
killedBy: isString isString('5') should be false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/check/isString.ts:4:12
 
 
 export const isString = (valor:unknown ):valor is string =>{
-    return typeof valor === "string";
+    return typeof valor !== "string";
 }
 
killedBy: isString isString('') should be true
statusReason: expected false to be true // Object.is equality
