[Killed] BlockStatement
src/misc/typeOf.ts:4:51
 
 
 
-export const typeOf = (value: unknown):unknown => {
-    
-    return value === null ? "null" : typeof value;
-}
+export const typeOf = (value: unknown):unknown => {}
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/misc/typeOf.ts:6:12
 
 export const typeOf = (value: unknown):unknown => {
     
-    return value === null ? "null" : typeof value;
+    return value !== null ? "null" : typeof value;
 }
killedBy: isObjectLike() isObjectLike({}) should be true
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/misc/typeOf.ts:6:12
 
 export const typeOf = (value: unknown):unknown => {
     
-    return value === null ? "null" : typeof value;
+    return false ? "null" : typeof value;
 }
killedBy: isObjectLike() isObjectLike(null) should be false
statusReason: expected true to be false // Object.is equality
