[Killed] BlockStatement
src/strings/capitalize.ts:3:48
 
 
-export const capitalize =(str:string):string =>{
-
-    return str.split(" ").map((word)=>{
-        return word.charAt(0).toUpperCase() + word.slice(1).toLocaleLowerCase();
-    }).join(" ");
-
-   
-}
+export const capitalize =(str:string):string =>{}
killedBy: capitalize capitalize('coca cola') shoul be return 'Coca cola'
statusReason: expected undefined to be 'Coca Cola' // Object.is equality

[Killed] BlockStatement
src/strings/capitalize.ts:5:39
 
 export const capitalize =(str:string):string =>{
 
-    return str.split(" ").map((word)=>{
-        return word.charAt(0).toUpperCase() + word.slice(1).toLocaleLowerCase();
-    }).join(" ");
+    return str.split(" ").map((word)=>{}).join(" ");
 
    
killedBy: capitalize capitalize('coca cola') shoul be return 'Coca cola'
statusReason: expected ' ' to be 'Coca Cola' // Object.is equality

[Killed] StringLiteral
src/strings/capitalize.ts:5:22
 
 export const capitalize =(str:string):string =>{
 
-    return str.split(" ").map((word)=>{
+    return str.split("").map((word)=>{
         return word.charAt(0).toUpperCase() + word.slice(1).toLocaleLowerCase();
     }).join(" ");
killedBy: capitalize capitalize('coca cola') shoul be return 'Coca cola'
statusReason: expected 'C O C A   C O L A' to be 'Coca Cola' // Object.is equality

[Killed] MethodExpression
src/strings/capitalize.ts:6:16
 export const capitalize =(str:string):string =>{
 
     return str.split(" ").map((word)=>{
-        return word.charAt(0).toUpperCase() + word.slice(1).toLocaleLowerCase();
+        return word.toUpperCase() + word.slice(1).toLocaleLowerCase();
     }).join(" ");
 
killedBy: capitalize capitalize('coca cola') shoul be return 'Coca cola'
statusReason: expected 'COCAoca COLAola' to be 'Coca Cola' // Object.is equality

[Killed] MethodExpression
src/strings/capitalize.ts:6:16
 export const capitalize =(str:string):string =>{
 
     return str.split(" ").map((word)=>{
-        return word.charAt(0).toUpperCase() + word.slice(1).toLocaleLowerCase();
+        return word.charAt(0).toLowerCase() + word.slice(1).toLocaleLowerCase();
     }).join(" ");
 
killedBy: capitalize capitalize('coca cola') shoul be return 'Coca cola'
statusReason: expected 'coca cola' to be 'Coca Cola' // Object.is equality
