[Killed] BlockStatement
src/strings/includes.ts:2:61
 
-export const includes =(str:unknown,value:string):boolean =>{
-    return (typeof str === "string") ? str.includes(value) : false
-}
+export const includes =(str:unknown,value:string):boolean =>{}
killedBy: Includes() includes('hola','ho') should be true
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/strings/includes.ts:3:13
 
 export const includes =(str:unknown,value:string):boolean =>{
-    return (typeof str === "string") ? str.includes(value) : false
+    return (false) ? str.includes(value) : false
 }
killedBy: Includes() includes('hola','ho') should be true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/strings/includes.ts:3:13
 
 export const includes =(str:unknown,value:string):boolean =>{
-    return (typeof str === "string") ? str.includes(value) : false
+    return (typeof str !== "string") ? str.includes(value) : false
 }
killedBy: Includes() includes('hola','ho') should be true
statusReason: expected false to be true // Object.is equality
