[Killed] BlockStatement
src/timing/debounce.ts:3:100
 import {type AnyFunction } from "../types/helpers";
 
-export function debounce<T extends AnyFunction>(fn:T,delay:number):(...args:Parameters<T>) => void {
-    let timeoutId: ReturnType<typeof setTimeout> | undefined//c@types/node
-    return function debounceFunction(...args:Parameters<T>):void{
-        if (timeoutId !== undefined) { 
-            clearTimeout(timeoutId)}
-        timeoutId=setTimeout(()=>fn(...args),delay)
-    }
-    
-}
+export function debounce<T extends AnyFunction>(fn:T,delay:number):(...args:Parameters<T>) => void {}
 
 // function greet (name:string,age:number):void {
killedBy: Debounce() should debounce a generic function an execute 0 times
statusReason: debouncedFn is not a function

[Killed] BlockStatement
src/timing/debounce.ts:5:65
 
 export function debounce<T extends AnyFunction>(fn:T,delay:number):(...args:Parameters<T>) => void {
     let timeoutId: ReturnType<typeof setTimeout> | undefined//c@types/node
-    return function debounceFunction(...args:Parameters<T>):void{
-        if (timeoutId !== undefined) { 
-            clearTimeout(timeoutId)}
-        timeoutId=setTimeout(()=>fn(...args),delay)
-    }
+    return function debounceFunction(...args:Parameters<T>):void{}
     
 }
killedBy: Debounce() should debounce a generic function an execute 0 times
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/timing/debounce.ts:6:13
 export function debounce<T extends AnyFunction>(fn:T,delay:number):(...args:Parameters<T>) => void {
     let timeoutId: ReturnType<typeof setTimeout> | undefined//c@types/node
     return function debounceFunction(...args:Parameters<T>):void{
-        if (timeoutId !== undefined) { 
+        if (false) { 
             clearTimeout(timeoutId)}
         timeoutId=setTimeout(()=>fn(...args),delay)
killedBy: Debounce() should debounce a generic function an execute 0 times
statusReason: expected "vi.fn()" to be called 1 times, but got 4 times

[Killed] BlockStatement
src/timing/debounce.ts:6:38
 export function debounce<T extends AnyFunction>(fn:T,delay:number):(...args:Parameters<T>) => void {
     let timeoutId: ReturnType<typeof setTimeout> | undefined//c@types/node
     return function debounceFunction(...args:Parameters<T>):void{
-        if (timeoutId !== undefined) { 
-            clearTimeout(timeoutId)}
+        if (timeoutId !== undefined) {}
         timeoutId=setTimeout(()=>fn(...args),delay)
     }
killedBy: Debounce() should debounce a generic function an execute 0 times
statusReason: expected "vi.fn()" to be called 1 times, but got 4 times

[Killed] ArrowFunction
src/timing/debounce.ts:8:30
     return function debounceFunction(...args:Parameters<T>):void{
         if (timeoutId !== undefined) { 
             clearTimeout(timeoutId)}
-        timeoutId=setTimeout(()=>fn(...args),delay)
+        timeoutId=setTimeout(() => undefined,delay)
     }
     
killedBy: Debounce() should debounce a generic function an execute 0 times
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
