[Killed] BlockStatement
src/timing/throttle.ts:4:103
 import type { AnyFunction } from "../types/helpers";
 
 
-export function throttle<T extends AnyFunction> (fn:T,delay:number): (...args: Parameters<T>) => void {
-   
-   let timeoutId:ReturnType<typeof setTimeout> | undefined
-    return function throttledFn (...args:Parameters<T>) {
-        if(timeoutId !== undefined){
-            return
-        }
-        timeoutId = setTimeout(()=>{
-            timeoutId = undefined
-        },delay)
-        return fn(...args)
-    }
-}
+export function throttle<T extends AnyFunction> (fn:T,delay:number): (...args: Parameters<T>) => void {}
killedBy: throttle should throttle a function 1 time
statusReason: throttleFn is not a function

[Killed] BlockStatement
src/timing/throttle.ts:7:57
 export function throttle<T extends AnyFunction> (fn:T,delay:number): (...args: Parameters<T>) => void {
    
    let timeoutId:ReturnType<typeof setTimeout> | undefined
-    return function throttledFn (...args:Parameters<T>) {
-        if(timeoutId !== undefined){
-            return
-        }
-        timeoutId = setTimeout(()=>{
-            timeoutId = undefined
-        },delay)
-        return fn(...args)
-    }
+    return function throttledFn (...args:Parameters<T>) {}
 }
killedBy: throttle should throttle a function 1 time
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/timing/throttle.ts:8:12
    
    let timeoutId:ReturnType<typeof setTimeout> | undefined
     return function throttledFn (...args:Parameters<T>) {
-        if(timeoutId !== undefined){
+        if(timeoutId === undefined){
             return
         }
killedBy: throttle should throttle a function 1 time
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/timing/throttle.ts:8:12
    
    let timeoutId:ReturnType<typeof setTimeout> | undefined
     return function throttledFn (...args:Parameters<T>) {
-        if(timeoutId !== undefined){
+        if(true){
             return
         }
killedBy: throttle should throttle a function 1 time
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/timing/throttle.ts:11:36
         if(timeoutId !== undefined){
             return
         }
-        timeoutId = setTimeout(()=>{
-            timeoutId = undefined
-        },delay)
+        timeoutId = setTimeout(()=>{},delay)
         return fn(...args)
     }
killedBy: throttle should throttle a function 1 time
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times
